rheoTool/tutorials/rheoMultiRegionFoam/calibrator/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(

 (0 0 0)
 (50 0 0)
 (50 2 0)
 (50 2 0)
 (50 12 0)
 (0 12 0)
 (0 2 0)
 (0 2 0)
 
 (0 0 1)
 (50 0 1)
 (50 2 1)
 (50 2 1)
 (50 12 1)
 (0 12 1)
 (0 2 1)
 (0 2 1)

);

blocks
(

    hex (0 1 2 7 8 9 10 15) polymer (750 30 1) simpleGrading (1 1 1) //0  
    
   
);

edges
(

  
);

boundary
(
   
  p_inlet
  {
      type patch;
      faces
      (
         (0 7 15 8)                      
      );
  }
  
  p_outlet
  {
      type patch;
      faces
      (
         (1 2 10 9)                      
      );
  }
  
  p_down
  {
      type patch;
      faces
      (
         (0 1 9 8)                      
      );
  }
  
  p_interface
  {
      type patch;
      faces
      (
         (7 2 10 15)                      
      );
  }
  
   
  bottom
  {
      type empty;
      faces
      (
         (0 1 2 7)
                         
      );
  }
  
  top
  {
      type empty;
      faces
      (
         (8 9 10 15)
                             
      );
  }
    
   
);

mergePatchPairs
(
);

// ************************************************************************* //
