rheoTool/tutorials/rheoMultiRegionFoam/calibrator/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coupledSolvers
{
  T
  {
    solveCoupledT true;
     
    saveSystem true;
    robustSumCheck  true;
    updatePrecondFrequency 10000;  
    updateMatrixCoeffs false;  
  }

}

PIMPLE
{
  nOuterCorrectors    1;
}

// ************************************************************************* //
